piano_app/app/controllers/composers_controller.rb

  def index
    @composers = Composer.all
---
SELECT "composers".* FROM "composers"

  def show
    @composer = Composer.find(params[:id])
---
SELECT  "composers".* FROM "composers" WHERE "composers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @composer = Composer.create(composer_params)
---
INSERT INTO "composers" ("name", "bio", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Test"], ["bio", "Test"], ["image", "Tese"], ["created_at", "2018-03-07 22:00:30.856740"], ["updated_at", "2018-03-07 22:00:30.856740"]]

  def edit
    @composer = Composer.find(params[:id])
---
SELECT  "composers".* FROM "composers" WHERE "composers"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

  def update
    @composer = Composer.find(params[:id])

    if @composer.update(composer_params)
---
SELECT  "composers".* FROM "composers" WHERE "composers"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "composers" SET "name" = $1, "bio" = $2, "image" = $3, "updated_at" = $4 WHERE "composers"."id" = $5  [["name", "tetetet"], ["bio", "etetet"], ["image", "etet"], ["updated_at", "2018-03-07 22:08:00.353934"], ["id", 1]]

  def destroy
    composer = Composer.find(params[:id])
    composer.delete
---
SELECT  "composers".* FROM "composers" WHERE "composers"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "composers" WHERE "composers"."id" = $1  [["id", 6]]