piano_app/app/controllers/pieces_controller.rb

SELECT "pieces".* FROM "pieces"
---
  def index
    @pieces = Piece.all

SELECT  "pieces".* FROM "pieces" WHERE "pieces"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def show
    @piece = Piece.find(params[:id])

INSERT INTO "pieces" ("name", "url", "composer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "ave maria"], ["url", "url"], ["composer_id", 7], ["created_at", "2018-03-07 23:02:38.938423"], ["updated_at", "2018-03-07 23:02:38.938423"]]
---
  def create
    @piece = Piece.create!(piece_params)

SELECT  "pieces".* FROM "pieces" WHERE "pieces"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @piece = Piece.find(params[:id])

SELECT  "pieces".* FROM "pieces" WHERE "pieces"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
UPDATE "pieces" SET "name" = $1, "composer_id" = $2, "updated_at" = $3 WHERE "pieces"."id" = $4  [["name", "AVE MARIA"], ["composer_id", 4], ["updated_at", "2018-03-07 23:08:48.642486"], ["id", 16]]
---
  def update
    @piece = Piece.find(params[:id])

    if @piece.update(piece_params)

SELECT  "pieces".* FROM "pieces" WHERE "pieces"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
DELETE FROM "pieces" WHERE "pieces"."id" = $1  [["id", 17]]
---
  def destroy
    @piece = Piece.find(params[:id])
    @piece.delete