piano_app/app/views/composers/show.html.erb

SELECT "pieces".* FROM "pieces" WHERE "pieces"."composer_id" = $1  [["composer_id", 2]]
---
  <article><%= @composer[:bio] %></article>
  <% @composer.pieces.each do |piece| %>